
<template>
  <div class="non">
    <p>เลือกประเภทภาพยนตร์:</p>
    <button v-for="(genre, index) in genres" :key="index" @click="displayGenre(genre)">{{ genre.name }}</button>
    <div class="genre-content" v-if="selectedGenre">
      <h1>{{ selectedGenre.name }}</h1>
      <p>{{ selectedGenre.img }}</p>
      <p>{{ selectedGenre.description }}</p>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      genres: [
        { name: 'Action movie (ภาพยนตร์แอคชั่น)',
        description: 'Action หมายถึง ภาพยนตร์แบบบู๊ แอ็กชั่น ยิง ต่อสู้ ระทึกใจ เหมาะสำหรับคนชอบความแข็งแรงและศิลปะการต่อสู้ ในภาพยนตร์แนวนี้จะมีฉากยิง ระเบิด เผาสิ่งต่างๆ ที่เราอาจจะหาดูได้ยาก ฉะนั้นคนที่ชอบหนังประเภทนี้ไม่ใช่เพราะชอบความรุนแรง แต่จะหมายถึงคนที่ชอบที่จะสัมผัสกับสิ่งที่หาดูไม่ได้ในชีวิตประจำวันและชอบความตื่นเต้นอยู่ด้วย ปัจจุบันภาพยนตร์ประเภทนี้ มีออกมาฉายกันมากไม่เคยขาดและได้รับการตอบกลับอย่างดี แต่ก็ต้องมีเนื้อหาสาระและมุมมองของการออกแบบฉากได้อย่างลงตัวและสมจริงด้วย อย่างองค์บากทั้งสองภาคก็ขายความแอ๊คชั่นเป็นจุดสำคัญ และอื่นๆ อีกมากมาย' },
        { name: 'Adventure (ภาพยนตร์ผจญภัย)', 
        description: 'ภาพยนตร์ แนวผจญภัย เข้าป่าฝ่าดง เจอปัญหาอุปสรรคมากมาย และต้องมีการแก้ไข ปัญหาสถานการณ์ หนังแบบนี้ก็เหมาะสมหรับผู้ชมที่ชื่นชอบการผจญภัย เช่น เข้าไปในป่าที่ยังไม่รู้จักว่ามีอะไรบ้างที่รอการเข้าไปค้นหาจากเรา' },
        { name: 'Drama Movies (ภาพยนตร์ดราม่า)', 
        description: 'ภาพยนตร์ชีวิต ที่จะได้ความรู้สึกซึ้งเศร้า เคล้าน้ำตา ทำให้นึกถึงชีวิตคนจริงๆ บางเรื่องดูแล้วเครียด บางเรื่องก็เศร้ามากๆ แต่พอหนังจบก็โล่งหัว' },
        { name: 'Sci-Fi Movies (ภาพยนตร์วิทยาศาสตร์)', 
        description: 'ภาพยนตร์ที่มีเนื้อหาอ้างอิงวิทยาศาสตร์ แต่ทำออกมาให้น่าสนใจอาจจะผสมจินตนาการเข้าไปด้วย แต่หลายคนบอกว่าไม่ชอบเพราะดูไม่รู้เรื่อง ซึ่งก็เป็นความจริงเพราะบางเรื่องก็ต้องอาศัยความรู้พื้นฐานเป็นเดิมพันบ้าง แต่ถ้าหากชมบ่อยๆ ก็จะเริ่มรู้เรื่องและกลายเป็นคนชอบหนังประเภทนี้ก็ได้ หนังแนวนี้สามารถต่อจินตนาการให้เราได้ เผลอๆ คนที่ดูอาจจะคิดอะไรดีๆ ออกมาสร้างประโยชน์ให้กับคนรอบข้างได้ และแนวคิดของหนังแนวนี้ก็เป็นแรงกระตุ้นให้นักวิทยาศาสตร์พยายามทำให้ได้แบบในหนัง' },
        { name: 'Family (ภาพยนตร์ครอบครัว)', 
        description: 'เป็นภาพยนตร์ที่คนทุกคนในครอบครัวดูได้ ส่วนใหญ่เป็นภาพยนตร์ที่มีเนื้อหาเกี่ยวกับความผูกพัน ของคนในครอบครัว ส่วนใหญ่ก็จะแฝงแง่คิดเอาไว้และเดินเรื่องแบบเรียบง่าย เน้นความรักกันของคนในครอบครัว' },
        { name: 'Crime (ภาพยนตร์อาชญากรรม)', 
        description: 'ภาพยนตร์อาชญากรรม แนวการแก้ไข ต่อสู้กับคดีต่างๆ ของตำรวจ' },
        { name: 'Animation (ภาพยนตร์การ์ตูน)', 
        description: 'ภาพยนตร์การ์ตูน ซึ่งปัจจุบันกำลังมาแรง เช่น finding nemo เป็นต้น ปัจจุบันมีการผลิตออกมาได้น่าดูและแนบเนียนขึ้น ประเทศไทยเองก็มีออกมาหลายเรื่องและได้รับการต้อนรับมากโดยเฉพาะเด็กๆ ที่ขาดกันไม่ได้' },
        { name: 'Comedy (ภาพยนตร์ตลก)', 
        description: 'ภาพยนตร์ตลก เบาสมอง เหมาะกับคนที่ต้องการดูเพื่อการพักผ่อน ไม่ต้องคิดอะไรมาก' },
        { name: 'Erotic (ภาพยนตร์ผู้ใหญ่)', 
        description: 'เป็นภาพยนตร์ที่ไม่เหมาะกับผู้ที่มีอายุไม่ถึง 18 ปี เพราะเป็นเรื่องเกี่ยวกับเพศ ในประเทศไทยไม่มีเพราะทำออกมาก็ไม่ผ่านการเซ็นเซอร์' },
        { name: 'Fantasy (ภาพยนตร์ผสมจินตนาการ)', 
        description: 'ภาพยนตร์ที่มีการผสมจินตนาการแบบที่เราๆ ไม่ค่อยเห็นในชีวิต จะเรียกว่า เหนือจริงก็ได้ เด็กๆ หลายคนชอบจนถึงขั้นติดเลย' },
        { name: 'Musicals Movies (ภาพยนตร์เพลง)', 
        description: ' ภาพยนตร์เพลง เช่น ชิคาโก ประเทศไทยยังไม่มีให้เห็นเป็นเรื่องเป็นราวสักเรื่อง แต่ก็ยากที่จะทำให้มีรายได้เพราะความนิยมของคนแนวนี้ไม่มาก' },
        { name: 'Romance (ภาพยนตร์โรแมนติก)', 
        description: 'ภาพยนตร์แนวรักโรแมนติก เหมาะกับคู่หนุ่มสาวและผู้ที่กำลังมีความรักทั้งหลายหรือคนที่กำลังอยากจะรักใคร ชมไว้เป็นแนวทางในการทำตนเมื่อมีคนรัก จะได้ความรู้สึกมากขึ้นหากเราเคยมีประสบการณ์และความรู้สึกเหมือนในภาพยนตร์ จึงไม่แปลกใจที่หลายคนร้องไห้กับหนัง' },
      ],
      selectedGenre: null,
    };
  },
  methods: {
    displayGenre(genre) {
      this.selectedGenre = genre;
    },
  },
};
</script>


<style scoped>
@import url('https://fonts.googleapis.com/css2?family=Itim&family=Kodchasan:ital,wght@1,600&family=Mali&family=Mooli&family=Nunito:wght@500&family=Roboto+Slab&family=Sriracha&display=swap');
.genre-content {
  text-align: center;
  display: flex;
  flex-direction: column;
  align-items: center;
  
}

button {
  background-color: #fb4e4e;
  color: #ffffff;
  padding: 20px 40px;
  margin: 20px;
  border-radius: 20px;
  cursor: pointer;
  font-family: 'Itim', cursive;
  font-size: 20px;
  font-weight:300;
  margin-left:30px;
  margin-right:30px;

}

button:hover {
  background-color: #ff0000;
}

h1 {
   text-align: center;
  font-size: 24px;
  color: #f7f7f7;
  padding: 20px;
  font-family: 'Itim', cursive;

}

p {
   text-align: center;
  font-size: 25px;
  color: #ffffff;
  margin-bottom: 20px; 
  font-family: 'Itim', cursive;
  padding-top:200px ;
  
}
.non{
  background-color:#232323;
  padding-bottom: 500px;
}

</style>

